# Document Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitAPIPreDocEventArgs..::..Document Property
RevitAPIPreDocEventArgs Class See Also
---
The document associated with the event.
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2010
# Syntax
C#
---
```text
public Document Document { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Document As Document
	Get
```

Visual C++
---
```text
public:
property Document^ Document {
	Document^ get ();
}
```

# See Also
RevitAPIPreDocEventArgs Class
Autodesk.Revit.DB.Events Namespace